NakIwan/Training_PSoC_6/ch03_ble_Write_Central/main.c
#include "cybsp.h"
#include "cyhal.h"
#include "cy_retarget_io.h"

/* Library for malloc and free */
#include "stdlib.h"

/* FreeRTOS */
#include <FreeRTOS.h>
#include <task.h>
#include <timers.h>

/* btstack */
#include "wiced_bt_stack.h"

/* App utilities */
#include "app_bt_utils.h"

/* Include header files from BT configurator */
#include "cycfg_bt_settings.h"
#include "cycfg_gap.h"
#include "cycfg_gatt_db.h"
#include <string.h>


/*******************************************************************
 * Macros to assist development of the exercises
 ******************************************************************/
#ifndef CYBSP_USER_LED2
#define CYBSP_USER_LED2 P7_1
#endif

#define TASK_STACK_SIZE (4096u)
#define	TASK_PRIORITY 	(5u)

#define APP_TIMEOUT_LED_BLINK          (100)

#define BAUD_RATE       9600
#define UART_DELAY      10u
#define RX_BUF_SIZE     32
#define TX_BUF_SIZE     32
#define RX_US100 P10_0
#define TX_US100 P10_1


/* Typdef for function used to free allocated buffer to stack */
typedef void (*pfn_free_buffer_t)(uint8_t *);

/*******************************************************************
 * Function Prototypes
 ******************************************************************/
/* Callback function for Bluetooth stack management type events */
static wiced_bt_dev_status_t app_bt_management_callback             (wiced_bt_management_evt_t event, wiced_bt_management_evt_data_t *p_event_data);

/* GATT Event Callback and Handler Functions */
static wiced_bt_gatt_status_t app_bt_gatt_event_callback            (wiced_bt_gatt_evt_t event, wiced_bt_gatt_event_data_t *p_event_data);

static wiced_bt_gatt_status_t app_bt_connect_event_handler          (wiced_bt_gatt_connection_status_t *p_conn_status);
static wiced_bt_gatt_status_t app_bt_server_event_handler           (wiced_bt_gatt_event_data_t *p_data);

static wiced_bt_gatt_status_t app_bt_write_handler                  (wiced_bt_gatt_event_data_t *p_data);
static wiced_bt_gatt_status_t app_bt_gatt_req_read_handler          (uint16_t conn_id, wiced_bt_gatt_opcode_t opcode,
                                                                    wiced_bt_gatt_read_t *p_read_req, uint16_t len_requested);
static wiced_bt_gatt_status_t app_bt_gatt_req_read_multi_handler    (uint16_t conn_id, wiced_bt_gatt_opcode_t opcode,
                                                                    wiced_bt_gatt_read_multiple_req_t *p_read_req, uint16_t len_requested);
static wiced_bt_gatt_status_t app_bt_gatt_req_read_by_type_handler  (uint16_t conn_id, wiced_bt_gatt_opcode_t opcode,
                                                                    wiced_bt_gatt_read_by_type_t *p_read_req, uint16_t len_requested);

/* Helper functions to find GATT database handles and allocate/free buffers for GATT operations */
static gatt_db_lookup_table_t 	*app_bt_find_by_handle(uint16_t handle);
static uint8_t 					*app_bt_alloc_buffer(uint16_t len);
static void 					app_bt_free_buffer(uint8_t *p_data);

/*******************************************************************
 * Global/Static Variables
 ******************************************************************/

/* Enable RTOS aware debugging in OpenOCD */
volatile int uxTopUsedPriority;

cyhal_pwm_t PWM_obj;

TaskHandle_t NotifyTaskHandle = NULL;
TaskHandle_t NotifyTaskHandle1 = NULL;
TimerHandle_t timer_led_blink;

uint8_t flag_US100;
uint8_t led_blink_count;

uint8_t      tx_buf[TX_BUF_SIZE];
uint8_t      rx_buf[RX_BUF_SIZE];
uint8_t      read_data[RX_BUF_SIZE];

uint16_t Distance;
uint16_t connection_id = 0;

size_t       tx_length = TX_BUF_SIZE;
size_t       rx_length = RX_BUF_SIZE;

const cyhal_uart_cfg_t uart_config =
{
	.data_bits = 8,
	.stop_bits = 1,
	.parity = CYHAL_UART_PARITY_NONE,
	.rx_buffer = rx_buf,
	.rx_buffer_size = RX_BUF_SIZE
};

void app_bt_timeout_led_blink(TimerHandle_t timer_handle)
{
    static wiced_bool_t led_on = WICED_TRUE;
    if (led_on)
    {
        cyhal_gpio_write(CYBSP_USER_LED, CYBSP_LED_STATE_OFF);
        if (--led_blink_count)
        {
            led_on = WICED_FALSE;
            xTimerStart(timer_led_blink, 0);
        }
    }
    else
    {
        led_on = WICED_TRUE;
        cyhal_gpio_write(CYBSP_USER_LED , CYBSP_LED_STATE_ON);
        xTimerStart(timer_led_blink, 0);
    }
}

void app_bt_led_blink(uint8_t num_of_blinks)
{
    if (num_of_blinks)
    {
    	for (int i = 0; i <num_of_blinks; i++){
            led_blink_count = num_of_blinks;
            cyhal_gpio_write(CYBSP_USER_LED , CYBSP_LED_STATE_ON);
            xTimerStart(timer_led_blink, 0);
    	}
    }
}

static void String_task(void * arg){

    cyhal_uart_t uart_obj;
    uint32_t     actualbaud;
	char buffer_text[24];

    cyhal_uart_init(&uart_obj, TX_US100, RX_US100, NC, NC, NULL, &uart_config);

    cyhal_uart_set_baud(&uart_obj, BAUD_RATE, &actualbaud);

	while(1){

		if (flag_US100){
			if (cyhal_uart_putc(&uart_obj, 0X55) == CY_RSLT_SUCCESS)
	    	{
	    		rx_length = 3;
	            cyhal_uart_read(&uart_obj, rx_buf, &rx_length);
	            Distance = (uint16_t)rx_buf[0] << 8 | rx_buf[1];
	            printf("US100 = %d mm\r\n",Distance);
	    	}
		}
		if(connection_id != 0){
    		if(app_psoc_string_client_char_config[0] & GATT_CLIENT_CONFIG_NOTIFICATION){
				sprintf(buffer_text,"US100 = %d", Distance);
				wiced_bt_gatt_server_send_notification( connection_id,
														HDLC_PSOC_STRING_VALUE,
														strlen(buffer_text),
														(uint8_t *)buffer_text,
														NULL);
    		}
		}
		vTaskDelay(50);
	}
}

int main(void)
{
    cy_rslt_t result ;

    /* Initialize the board support package */
    result = cybsp_init() ;
    if (result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(0);
    }

    /* Enable global interrupts */
    __enable_irq();

    /* Initialize retarget-io to use the debug UART port */
    cy_retarget_io_init(CYBSP_DEBUG_UART_TX, CYBSP_DEBUG_UART_RX,\
                        CY_RETARGET_IO_BAUDRATE);

    /* Initialize LED Pin */
    cyhal_gpio_init(CYBSP_USER_LED,CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG, CYBSP_LED_STATE_OFF);

